In [10]:
import sqlite3
import pandas.io.sql as pds
import pandas as pd

In [11]:
path = "baseball.db"
con = sqlite3.connect(path)

In [12]:
con

In [17]:
#write the query
query='''
SELECT *
FROM allstarfull;
'''
#Execute the query
observations = pds.read_sql(query,con)
observations.head()

,index,playerID,yearID,gameNum,gameID,teamID,lgID,GP,startingPos
0,0,gomezle01,1933,0,ALS193307060,NYA,AL,1.0,1.0
1,1,ferreri01,1933,0,ALS193307060,BOS,AL,1.0,2.0
2,2,gehrilo01,1933,0,ALS193307060,NYA,AL,1.0,3.0
3,3,gehrich01,1933,0,ALS193307060,DET,AL,1.0,4.0
4,4,dykesji01,1933,0,ALS193307060,CHA,AL,1.0,5.0

In [18]:
#create variable, tables, which reads in all data from the table sqlite_master
all_tables=pd.read_sql('SELECT*FROM sqlite_master',con)
print(all_tables)

    type                  name     tbl_name  rootpage  \
0  table           allstarfull  allstarfull         2
1  index  ix_allstarfull_index  allstarfull         3
2  table               schools      schools        26
3  index      ix_schools_index      schools        31
4  table               batting      batting        99
5  index      ix_batting_index      batting       100

                                                 sql
0  CREATE TABLE "allstarfull" (\n"index" INTEGER,...
1  CREATE INDEX "ix_allstarfull_index"ON "allstar...
2  CREATE TABLE "schools" (\n"index" INTEGER,\n  ...
3  CREATE INDEX "ix_schools_index"ON "schools" ("...
4  CREATE TABLE "batting" (\n"index" INTEGER,\n  ...
5  CREATE INDEX "ix_batting_index"ON "batting" ("...

In [19]:
#analyze the allstarfull table to report the top 3 players in terms of number of games played
#If there are ties, choose players with lower starting positions firsts
best_query='''
SELECT
playerID,
sum(GP) AS num_games_played,
AVG(startingPos) AS avg_starting_position
FROM allstarfull 
GROUP BY playerID
ORDER BY num_games_played DESC, avg_starting_position ASC
LIMIT 3
'''
best= pd.read_sql(best_query,con)
print(best.head())

    playerID  num_games_played  avg_starting_position
0  musiast01              24.0               6.357143
1   mayswi01              24.0               8.000000
2  aaronha01              24.0               8.470588

In [20]:
display(best)

    playerID  num_games_played  avg_starting_position
0  musiast01              24.0               6.357143
1   mayswi01              24.0               8.000000
2  aaronha01              24.0               8.470588